In [2]:
# Keep in mind that this is the function definition.  It is a blueprint for what WILL
#  happen when we actually call the function.  The "return" function is essentially what
#  the function evaluates to.  Now we can say....
#  is_it_chocolate = is_chocolate('vanilla'), and is_it_chocolate == False due to the return value.
#  Without the return keyword, nothing will really happen.  The logic will be evaluated and thrown away
#  because it's not told to return the value.
def is_chocolate(flavor):
    return flavor == "chocolate"


# Here, we're setting up variables that we can pass to the function.  We could also
#  just pass the actual values "vanilla" and "chocolate" to the function without
#  creating variables
flavor1 = "vanilla"
flavor2 = "chocolate"

# Play with the value here.  What do you expect to happen?
is_chocolate(flavor1)

False

In [6]:
def spread(values):
    return max(values) - min(values)

spread([5, 6, 7, 8, 9, 10])

5

In [4]:
def pig_latin(word):
    return word[1:] + word[0] + "ay"

print(pig_latin("pig"))
print(pig_latin("latin"))

# This one doesn't quite work because we didn't account for digraphs!
print(pig_latin("theory"))

igpay
atinlay
heorytay

In [11]:
def quadratic(x, a, b, c):
    return a*x*x + b*x + c

quadratic(1.0, 2.0, 3.0, 4.0)

9.0

***Note -- I don't have access the to the data used to run the cells below.  If you try to run them, they will fail.***

In [12]:
from datascience import *
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

In [17]:
def upper(name):
    return name.upper()

favorite_numbers.apply(upper, 'Name')

array(['COOK, KYLIE NICHOLE', 'DUERINCK, RANDY KEITH',
       'GRAHAM, CASSANDRA MICHELLE', 'HODGE, DEVIN JONATHAN MONROE',
       'LINDEN, ANDREW RYAN', 'LYNN, MATTHEW MICHAEL',
       'MARTINEZ, CARLI SABRINA', 'VERRANDO, FABIENNE ESTHER'],
      dtype='<U28')

In [18]:
def spread2(a, b):
    return spread([a,b])

favorite_numbers.apply(spread2, "Number1", "Number2")

array([ 4,  4,  2, 59,  2, 18, 20,  4])

In [15]:
favorite_numbers = Table().read_table("favorite_numbers.csv")
favorite_numbers

Name                         | Number1 | Number2
Cook, Kylie Nichole          | 2       | 6
Duerinck, Randy Keith        | 7       | 11
Graham, Cassandra Michelle   | 4       | 6
Hodge, Devin Jonathan Monroe | 75      | 16
Linden, Andrew Ryan          | 3       | 5
Lynn, Matthew Michael        | 26      | 8
Martinez, Carli Sabrina      | 21      | 1
Verrando, Fabienne Esther    | 20      | 24

In [19]:
student_brands = Table().read_table("student_brands.csv")
student_brands

Name                         | Brand
Cook, Kylie Nichole          | Honda
Duerinck, Randy Keith        | Chevy
Graham, Cassandra Michelle   | Nissan
Hodge, Devin Jonathan Monroe | Jeep
Linden, Andrew Ryan          | Toyota
Lynn, Matthew Michael        | Audi
Martinez, Carli Sabrina      | Toyota
Verrando, Fabienne Esther    | Nissan

In [20]:
brands = Table().read_table("brands.csv")
brands

Brand  | Parts
Honda  | International
Chevy  | Domestic
Nissan | International
Jeep   | Domestic
Toyota | International
Audi   | International

In [21]:
joined_table = student_brands.join('Brand', brands, 'Brand')
joined_table

Brand  | Name                         | Parts
Audi   | Lynn, Matthew Michael        | International
Chevy  | Duerinck, Randy Keith        | Domestic
Honda  | Cook, Kylie Nichole          | International
Jeep   | Hodge, Devin Jonathan Monroe | Domestic
Nissan | Graham, Cassandra Michelle   | International
Nissan | Verrando, Fabienne Esther    | International
Toyota | Linden, Andrew Ryan          | International
Toyota | Martinez, Carli Sabrina      | International

In [22]:
lt_players = Table().read_table("lt_players.csv")
lt_players

Name                         | Team | Score
Cook, Kylie Nichole          | Blue | 34
Duerinck, Randy Keith        | Red  | 64
Graham, Cassandra Michelle   | Red  | 78
Hodge, Devin Jonathan Monroe | Blue | 11
Linden, Andrew Ryan          | Blue | 56
Lynn, Matthew Michael        | Blue | 58
Martinez, Carli Sabrina      | Red  | 26
Verrando, Fabienne Esther    | Red  | 42

In [23]:
lt_teams = Table().read_table("lt_teams.csv")
lt_teams

Team | Bonus
Red  | 11
Blue | 22

In [24]:
lt_joined = lt_players.join("Team", lt_teams, "Team")
lt_joined

Team | Name                         | Score | Bonus
Blue | Cook, Kylie Nichole          | 34    | 22
Blue | Hodge, Devin Jonathan Monroe | 11    | 22
Blue | Linden, Andrew Ryan          | 56    | 22
Blue | Lynn, Matthew Michael        | 58    | 22
Red  | Duerinck, Randy Keith        | 64    | 11
Red  | Graham, Cassandra Michelle   | 78    | 11
Red  | Martinez, Carli Sabrina      | 26    | 11
Red  | Verrando, Fabienne Esther    | 42    | 11

In [25]:
total_score = lt_joined.column("Score") + lt_joined.column("Bonus")
total_score

array([56, 33, 78, 80, 75, 89, 37, 53])

In [26]:
lt_joined.with_column("Total Score", total_score)

Team | Name                         | Score | Bonus | Total Score
Blue | Cook, Kylie Nichole          | 34    | 22    | 56
Blue | Hodge, Devin Jonathan Monroe | 11    | 22    | 33
Blue | Linden, Andrew Ryan          | 56    | 22    | 78
Blue | Lynn, Matthew Michael        | 58    | 22    | 80
Red  | Duerinck, Randy Keith        | 64    | 11    | 75
Red  | Graham, Cassandra Michelle   | 78    | 11    | 89
Red  | Martinez, Carli Sabrina      | 26    | 11    | 37
Red  | Verrando, Fabienne Esther    | 42    | 11    | 53